wedding_planner_api/app/controllers/planners_controller.rb

SELECT "planners".* FROM "planners"
---
    def index
        #render json: "Testing Route for Planner"
        planners = Planner.all

SELECT "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        planner = Planner.find(params[:id])

INSERT INTO "planners" ("first_name", "last_name", "wedding_date") VALUES ($1, $2, $3) RETURNING "id"  [["first_name", "Tiffany"], ["last_name", "Nguyen"], ["wedding_date", "07042011"]]
---
    def create
        planner = Planner.new(planner_params)
        if planner.save

SELECT "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "planners" SET "wedding_date" = $1 WHERE "planners"."id" = $2  [["wedding_date", "May 20, 2018"], ["id", 2]]
---
    def update
        planner = Planner.find(params[:id])
        planner.update(planner_params)

DELETE FROM "planners" WHERE "planners"."id" = $1  [["id", 5]]
---
    def destroy
        planner = Planner.destroy(params[:id])